NordicSemiconductor/nrfx/mdk/nrf54l15_enga_application.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_CTRLAP_NS">
      <name>GLOBAL_CTRLAP_S</name>
      <description>Control access port 1</description>
      <baseAddress>0x50052000</baseAddress>
      <!--Security dma=NSA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>CTRLAP</name>
        <value>82</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>GLOBAL_TAD_NS</name>
      <description>Trace and debug control 0</description>
      <baseAddress>0x40053000</baseAddress>
      <headerStructName>TAD</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>TAD</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>SYSPWRUPREQ</name>
          <description>System power-up request</description>
          <addressOffset>0x400</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACTIVE</name>
              <description>Activate power-up request</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Power-up request not active</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power-up request active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGPWRUPREQ</name>
          <description>Debug power-up request</description>
          <addressOffset>0x404</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACTIVE</name>
              <description>Activate power-up request</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Power-up request not active</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power-up request active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE</name>
          <description>Enable debug domain and aquire selected GPIOs</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable debug domain and release selected GPIOs</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enable debug domain and aquire selected GPIOs</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRACEPORTSPEED</name>
          <description>Trace port speed</description>
          <addressOffset>0x518</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRACEPORTSPEED</name>
              <description>Trace port speed is divided from CPU clock. The TRACECLK pin output will be divided again by two from the trace port clock.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>Trace port speed equals CPU clock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>Trace port speed equals CPU clock divided by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>Trace port speed equals CPU clock divided by 4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <description>Trace port speed equals CPU clock divided by 32</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TINSTANCE</name>
          <description>SW-DP Target instance</description>
          <addressOffset>0x520</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TINSTANCE</name>
              <description>TINSTANCE bits are used in the SW-DP DLPIDR.TINSTANCE field.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
